Company Name Ticker Exchange GICS Sector GICS Industry Group GICS Industry GICS Sub-IndustryAmbev SA ABEV3 B3 S.A. Consumer Staples Food, Beverage and Tobacco Beverages BrewersAtacadao SA CRFB3 B3 S.A. Consumer Staples Food and Staples Retailing Food and Staples Retailing Hypermarkets and Super CentersB3 SA - Brasil Bolsa Balcao B3SA3 B3 S.A. Financials Diversified Financials Capital Markets Financial Exchanges & DataBanco BTG Pactual S.A. BPAC11 B3 S.A. Financials Diversified Financials Capital Markets Diversified Capital MarketsBanco do Brasil SA BB Brasil BBAS3 B3 S.A. Financials Banks Banks Diversified BanksBanco Santander (Brasil) SA SANB11 B3 S.A. Financials Banks Banks Diversified BanksBank Bradesco SA BBDC3 B3 S.A. Financials Banks Banks Diversified BanksBB Seguridade Participacoes SA BBSE3 B3 S.A. Financials Insurance Insurance Multi-line InsuranceBRF SA BRFS3 B3 S.A. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsCCR SA CCRO3 B3 S.A. Industrials Transportation Transportation Infrastructure Highways and RailtracksCentrais Eletricas Brasileiras SA ELET3 B3 S.A. Utilities Utilities Electric Utilities Electric UtilitiesCielo SA CIEL3 B3 S.A. Information Technology Software and Services IT Services Data Processing and Outsourced ServicesCompanhia De Saneamento Basico Do Estado De Sao Paulo SBSP3 B3 S.A. Utilities Utilities Water Utilities Water UtilitiesCompanhia Siderurgica Nacional CSNA3 B3 S.A. Materials Materials Metals and Mining SteelCosan SA CSAN3 B3 S.A. Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Refining and MarketingCPFL Energia S.A. CPFE3 B3 S.A. Utilities Utilities Electric Utilities Electric UtilitiesEmbraer SA EMBR3 B3 S.A. Industrials Capital Goods Aerospace and Defense Aerospace and DefenseENGIE Brasil Energia SA EGIE3 B3 S.A. Utilities Utilities Independent Power and Renewable Electricity Producers Renewable ElectricityEquatorial Energia SA EQTL3 B3 S.A. Utilities Utilities Electric Utilities Electric UtilitiesHypera SA HYPE3 B3 S.A. Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsIRB Brasil Resseguros SA IRBR3 B3 S.A. Financials Insurance Insurance ReinsuranceJBS SA JBSS3 B3 S.A. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsKlabin SA KLBN11 B3 S.A. Materials Materials Containers and Packaging Paper PackagingLocaliza Rent A Car SA RENT3 B3 S.A. Industrials Transportation Road and Rail TruckingLojas Renner SA LREN3 B3 S.A. Consumer Discretionary Retailing Multiline Retail Department StoresM Dias Branco SA Industria e Comercio de Alimentos MDIA3 B3 S.A. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsMagazine Luiza SA MGLU3 B3 S.A. Consumer Discretionary Retailing Multiline Retail General Merchandise StoresMultiplan Empreendimentos Imobiliarios SA MULT3 B3 S.A. Real Estate Real Estate Real Estate Management & Development Real Estate Operating CompaniesNatura & Co Holding SA NTCO3 B3 S.A. Consumer Staples Household and Personal Products Personal Products Personal ProductsPetroleo Brasileiro SA Petrobras PETR3 B3 S.A. Energy Energy Oil, Gas and Consumable Fuels Integrated Oil and GasPorto Seguro SA PSSA3 B3 S.A. Financials Insurance Insurance Multi-line InsuranceRaia Drogasil SA RADL3 B3 S.A. Consumer Staples Food and Staples Retailing Food and Staples Retailing Drug RetailRumo SA RAIL3 B3 S.A. Industrials Transportation Road and Rail RailroadsSuzano SA SUZB3 B3 S.A. Materials Materials Paper and Forest Products Paper ProductsUltrapar Participacoes SA UGPA3 B3 S.A. Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Storage and TransportationVale SA VALE3 B3 S.A. Materials Materials Metals and Mining SteelWeg SA WEGE3 B3 S.A. Industrials Capital Goods Electrical Equipment Electrical Components and EquipmentFomento Económico Mexicano, S.A.B. de C.V. FEMSAUBD BMV Consumer Staples Food, Beverage & Tobacco Beverages Soft DrinksGrupo Aeroportuario del Pacifico SAB de CV Class B GAPB BMV Industrials Transportation Transportation Infrastructure Airport ServicesGrupo Bimbo, S.A.B de C.V. BIMBOA BMV Consumer Staples Food, Beverage & Tobacco Food Products Packaged Foods & MeatsDelta Corp Ltd. 532848 BSE LTD Consumer Discretionary Hotels, Restaurants & Leisure Hotels, Restaurants & Leisure Casinos & GamingPower Finance Corporation 532810 BSE LTD Financials Diversified Financials Diversified Financial Services Specialized FinanceAsian Paints Ltd 500820 BSE LTD Materials Materials Chemicals Specialty ChemicalsAstra Microwave Products Ltd 532493 BSE LTD Information Technology Technology Hardware and Equipment Communications Equipment Communications EquipmentAtul Ltd 500027 BSE LTD Materials Materials Chemicals Diversified ChemicalsAurobindo Pharma Ltd 524804 BSE LTD Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsAxis Bank Ltd 532215 BSE LTD Financials Banks Banks Diversified BanksBajaj Auto Ltd 532977 BSE LTD Consumer Discretionary Automobiles and Components Automobiles Motorcycle ManufacturersBajaj Finserv Ltd 532978 BSE LTD Financials Diversified Financials Diversified Financial Services Other Diversified Financial ServicesBata India Ltd 500043 BSE LTD Consumer Discretionary Consumer Durables and Apparel Textiles, Apparel and Luxury Goods FootwearBerger Paints India Ltd 509480 BSE LTD Materials Materials Chemicals Commodity ChemicalsBharat Heavy Electricals Ltd 500103 BSE LTD Industrials Capital Goods Electrical Equipment Heavy Electrical EquipmentBharti Airtel Ltd 532454 BSE LTD Communication Services Telecommunication Services Wireless Telecommunication Services Wireless Telecommunication ServicesBosch Ltd 500530 BSE LTD Consumer Discretionary Automobiles and Components Auto Components Auto Parts and EquipmentCipla Ltd 500087 BSE LTD Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsCoal India Ltd 533278 BSE LTD Energy Energy Oil, Gas and Consumable Fuels Coal and Consumable FuelsDr Reddy's Laboratories Ltd 500124 BSE LTD Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalseClerx Services Ltd 532927 BSE LTD Information Technology Software and Services IT Services Data Processing and Outsourced ServicesGAIL (India) Ltd 532155 BSE LTD Utilities Utilities Gas Utilities Gas UtilitiesGodrej Agrovet Ltd 540743 BSE LTD Consumer Staples Food, Beverage and Tobacco Food Products Agricultural ProductsGodrej Consumer Products Ltd 532424 BSE LTD Consumer Staples Household and Personal Products Personal Products Personal ProductsGranules India Ltd 532482 BSE LTD Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsGujarat Industries Power Co Ltd 517300 BSE LTD Utilities Utilities Independent Power and Renewable Electricity Producers Independent Power Producers and Energy TradersHCL Technologies Ltd 532281 BSE LTD Information Technology Software and Services IT Services IT Consulting and Other ServicesHDFC Bank Ltd 500180 BSE LTD Financials Banks Banks Diversified BanksHero MotoCorp Ltd 500182 BSE LTD Consumer Discretionary Automobiles and Components Automobiles Motorcycle ManufacturersHindalco Industries Ltd 500440 BSE LTD Materials Materials Metals and Mining AluminumHindustan Unilever Ltd 500696 BSE LTD Consumer Staples Household and Personal Products Household Products Household ProductsICICI Bank Ltd 532174 BSE LTD Financials Banks Banks Diversified BanksInfosys Ltd 500209 BSE LTD Information Technology Software and Services IT Services IT Consulting and Other ServicesComplete List-By ExchangeITC Ltd 500875 BSE LTD Consumer Staples Food, Beverage and Tobacco Tobacco TobaccoJubilant Foodworks Ltd 533155 BSE LTD Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsJust Dial Ltd 535648 BSE LTD Communication Services Media & Entertainment Interactive Media & Services Interactive Media & ServicesKotak Mahindra Bank Ltd 500247 BSE LTD Financials Banks Banks Diversified BanksLarsen & Toubro Ltd 500510 BSE LTD Industrials Capital Goods Construction and Engineering Construction and EngineeringLTIMindtree 540005 BSE LTD Information Technology Software and Services IT Services IT Consulting and Other ServicesMahindra & Mahindra Ltd 500520 BSE LTD Consumer Discretionary Automobiles and Components Automobiles Automobile ManufacturersMaruti Suzuki India Ltd 532500 BSE LTD Consumer Discretionary Automobiles and Components Automobiles Automobile ManufacturersMax Financial Services Ltd 500271 BSE LTD Financials Insurance Insurance Life and Health InsuranceNestle India Ltd 500790 BSE LTD Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsNIIT Ltd 500304 BSE LTD Information Technology Software and Services IT Services IT Consulting and Other ServicesNTPC Ltd 532555 BSE LTD Utilities Utilities Independent Power and Renewable Electricity Producers Independent Power Producers and Energy TradersOil & Natural Gas Corp Ltd 500312 BSE LTD Energy Energy Oil, Gas and Consumable Fuels Integrated Oil and GasPiramal Enterprises Ltd 500302 BSE LTD Financials Diversified Financials Diversified Financial Services Specialized FinancePower Grid Corp Of India Ltd 532898 BSE LTD Utilities Utilities Electric Utilities Electric UtilitiesREC Ltd 532955 BSE LTD Financials Diversified Financials Diversified Financial Services Specialized FinanceReliance Industries Ltd 500325 BSE LTD Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Refining and MarketingSJVN Ltd 533206 BSE LTD Utilities Utilities Electric Utilities Electric UtilitiesState Bank of India 500112 BSE LTD Financials Banks Banks Diversified BanksSun Pharmaceuticals Industries Ltd 524715 BSE LTD Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsTata Consultancy Services Ltd 532540 BSE LTD Information Technology Software and Services IT Services IT Consulting and Other ServicesTata Motors Ltd 500570 BSE LTD Consumer Discretionary Automobiles and Components Automobiles Automobile ManufacturersTata Power Co Ltd 500400 BSE LTD Utilities Utilities Electric Utilities Electric UtilitiesTata Steel Ltd 500470 BSE LTD Materials Materials Metals and Mining SteelTech Mahindra Ltd 532755 BSE LTD Information Technology Software and Services IT Services IT Consulting and Other ServicesTitan Co Ltd 500114 BSE LTD Consumer Discretionary Consumer Durables and Apparel Textiles, Apparel and Luxury Goods Apparel, Accessories and Luxury GoodsUltraTech Cement Ltd 532538 BSE LTD Materials Materials Construction Materials Construction MaterialsVedanta Ltd 500295 BSE LTD Materials Materials Metals and Mining Diversified Metals and MiningWipro Ltd 507685 BSE LTD Information Technology Software and Services IT Services IT Consulting and Other ServicesYes Bank Ltd 532648 BSE LTD Financials Banks Banks Diversified BanksASML Holding NV ASML Euronext Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment Semiconductor EquipmentDanone BN Euronext Financials Diversified Financials Capital Markets Asset Management & Custody BanksL'Oreal OR Euronext Materials Materials Metals & Mining GoldLVMH MC Euronext Financials Diversified Financials Capital Markets Investment Banking & BrokerageUCB UCB Euronext Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsInstone Real Estate Group O.N. INS Frankfurt Stock Exchange Real Estate Real Estate Management & Development Real Estate Management & Development Real Estate DevelopmentVolkswagen VOW Frankfurt Stock Exchange Consumer Discretionary Automobiles & Components Automobiles Automobile ManufacturersAluminum Corporation of China Ltd 2600 Hong Kong Exchanges And Clearing Ltd Materials Materials Metals and Mining AluminumAnhui Conch Cement Co Ltd 00914 Hong Kong Exchanges And Clearing Ltd Materials Materials Construction Materials Construction MaterialsChina Construction Bank Corp 00939 Hong Kong Exchanges And Clearing Ltd Financials Banks Banks Diversified BanksChina Gas Holdings Ltd 00384 Hong Kong Exchanges And Clearing Ltd Utilities Utilities Gas Utilities Gas UtilitiesChina Mobile Ltd 00941 Hong Kong Exchanges And Clearing Ltd Communication Services Telecommunication Services Wireless Telecommunication Services Wireless Telecommunication ServicesChina State Construction International Holdings Ltd 03311 Hong Kong Exchanges And Clearing Ltd Industrials Capital Goods Construction and Engineering Construction and EngineeringCITIC Ltd 00267 Hong Kong Exchanges And Clearing Ltd Industrials Capital Goods Industrial Conglomerates Industrial ConglomeratesHuaneng Power International Inc 0902 Hong Kong Exchanges And Clearing Ltd Utilities Utilities Independent Power and Renewable Electricity Producers Independent Power Producers and Energy TradersMeituan 03690 Hong Kong Exchanges And Clearing Ltd Consumer Discretionary Retailing Internet & Direct Marketing Retail Internet & Direct Marketing RetailPing An Insurance (Group) Co. of China Ltd 02318 Hong Kong Exchanges And Clearing Ltd Financials Insurance Insurance Life and Health InsuranceTencent Holdings Ltd 00700 Hong Kong Exchanges And Clearing Ltd Communication Services Media & Entertainment Interactive Media & Services Interactive Media & ServicesHD Korea Shipbuilding & Offshore Engineering Company 009540 Korea Exchange Industrials Capital Goods Machinery Construction & Farm Machinery & Heavy TrucksLG Chem Ltd. 51910 Korea Exchange Materials Materials Chemicals Commodity ChemicalsPOSCO Future M Co., Ltd 003670 Korea Exchange Materials Materials Metals & Mining SteelSamsung Electronics Co Ltd 005930 Korea Exchange Information Technology Technology Hardware & Equipment Technology Hardware, Storage & Peripherals Technology Hardware, Storage & PeripheralsAstraZeneca PLC AZN London Stock Exchange Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsAviva PLC AV London Stock Exchange Financials Insurance Insurance Multi-line InsuranceBHP Group PLC BHP London Stock Exchange Materials Materials Metals and Mining Diversified Metals and MiningBT Group PLC BT.A London Stock Exchange Communication Services Telecommunication Services Diversified Telecommunication Services Integrated Telecommunication ServicesBunzl PLC BNZL London Stock Exchange Industrials Capital Goods Trading Companies and Distributors Trading Companies and DistributorsCarclo PLC CAR London Stock Exchange Materials Materials Chemicals Specialty ChemicalsCarnival PLC CCL London Stock Exchange Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Hotels, Resorts and Cruise LinesCity of London Investment Group PLC CLIG London Stock Exchange Financials Diversified Financials Capital Markets Asset Management and Custody BanksCompass Group PLC CPG London Stock Exchange Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsdiscoverIE Group PLC DSCV London Stock Exchange Industrials Capital Goods Electrical Equipment Electrical Components and EquipmentDominos Pizza Inc DOM London Stock Exchange Consumer Discretionary Consumer Services Hotels, Restaurants & Leisure RestaurantseasyJet PLC EZJ London Stock Exchange Industrials Transportation Airlines AirlinesExperian PLC EXPN London Stock Exchange Industrials Commercial Services and Supplies Professional Services Research and Consulting ServicesFerguson PLC FERG London Stock Exchange Industrials Capital Goods Trading Companies and Distributors Trading Companies and DistributorsGlencore PLC GLEN London Stock Exchange Materials Materials Metals and Mining Diversified Metals and MiningHostelworld Group PLC HSW London Stock Exchange Consumer Discretionary Retailing Internet & Direct Marketing Retail Internet & Direct Marketing RetailHSBC Holdings PLC HSBA London Stock Exchange Financials Banks Banks Diversified BanksInterContinental Hotels Group PLC IHG London Stock Exchange Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Hotels, Resorts and Cruise LinesJohnson Matthey PLC JMAT London Stock Exchange Materials Materials Chemicals Specialty ChemicalsComplete List-By ExchangeLloyds Banking Group PLC LLOY London Stock Exchange Financials Banks Banks Diversified BanksLookers PLC LOOK London Stock Exchange Consumer Discretionary Retailing Specialty Retail Automotive RetailMondi PLC MNDI London Stock Exchange Materials Materials Paper and Forest Products Paper ProductsNatWest Group PLC NWG London Stock Exchange Financials Banks Banks Diversified BanksNext PLC NXT London Stock Exchange Consumer Discretionary Retailing Multiline Retail Department StoresOn The Beach Group PLC OTB London Stock Exchange Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Hotels, Resorts and Cruise LinesPearson PLC PSON London Stock Exchange Communication Services Media & Entertainment Media PublishingReckitt Benckiser Group PLC RKT London Stock Exchange Consumer Staples Household and Personal Products Household Products Household ProductsRightmove Plc RMV London Stock Exchange Communication Services Media & Entertainment Interactive Media & Services Interactive Media & ServicesRio Tinto PLC RIO London Stock Exchange Materials Materials Metals and Mining Diversified Metals and MiningRoyal Dutch Shell PLC SHEL London Stock Exchange Energy Energy Oil, Gas and Consumable Fuels Integrated Oil and GasSage Group (The) PLC SGE London Stock Exchange Information Technology Software and Services Software Application SoftwareSainsbury (J) PLC SBRY London Stock Exchange Consumer Staples Food and Staples Retailing Food and Staples Retailing Food RetailSchroders PLC SDR London Stock Exchange Financials Diversified Financials Capital Markets Asset Management and Custody BanksSevern Trent PLC SVT London Stock Exchange Utilities Utilities Water Utilities Water UtilitiesSmith & Nephew PLC SN London Stock Exchange Health Care Health Care Equipment and Services Health Care Equipment and Supplies Health Care EquipmentSmiths Group PLC SMIN London Stock Exchange Industrials Capital Goods Industrial Conglomerates Industrial ConglomeratesSSE PLC SSE London Stock Exchange Utilities Utilities Electric Utilities Electric UtilitiesStandard Chartered PLC STAN London Stock Exchange Financials Banks Banks Diversified BanksTullow Oil PLC TLW London Stock Exchange Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Exploration and ProductionUnilever PLC ULVR London Stock Exchange Consumer Staples Household and Personal Products Personal Products Personal ProductsUnited Utilities Group PLC UU London Stock Exchange Utilities Utilities Water Utilities Water UtilitiesVodafone Group PLC VOD London Stock Exchange Communication Services Telecommunication Services Wireless Telecommunication Services Wireless Telecommunication ServicesWhitbread PLC WTB London Stock Exchange Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Hotels, Resorts and Cruise LinesWynnstay Group PLC WYN London Stock Exchange Consumer Staples Food, Beverage and Tobacco Food Products Agricultural ProductsAlphawave IP Group AWE London Stock Exchange Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment SemiconductorsRolls-Royce Holdings PLC RR London Stock Exchange Industrials Capital Goods Aerospace & Defense Aerospace & DefenseAcadia Healthcare Co Inc ACHC Nasdaq Health Care Health Care Equipment and Services Health Care Providers and Services Health Care FacilitiesActivision Blizzard Inc ATVI Nasdaq Communication Services Media & Entertainment Entertainment Interactive Home EntertainmentAdobe Inc ADBE Nasdaq Information Technology Software and Services Software Application SoftwareAdvanced Micro Devices AMD Nasdaq Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment SemiconductorsAehr Test Systems AEHR Nasdaq Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment Semiconductor EquipmentAemetis Inc AMTX Nasdaq Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Refining and MarketingAlphabet Inc GOOG Nasdaq Communication Services Media & Entertainment Interactive Media & Services Interactive Media & ServicesAmazon.com Inc AMZN Nasdaq Consumer Discretionary Retailing Internet & Direct Marketing Retail Internet & Direct Marketing RetailAmerican Airlines Group Inc AAL Nasdaq Industrials Transportation Airlines AirlinesAmerican Electric Power Co Inc AEP Nasdaq Utilities Utilities Electric Utilities Electric UtilitiesAmgen Inc AMGN Nasdaq Health Care Pharmaceuticals and Biotechnology Biotechnology BiotechnologyApple Inc AAPL Nasdaq Information Technology Technology Hardware and Equipment Technology Hardware, Storage and Peripherals Technology Hardware, Storage and PeripheralsArcBest Corp ARCB Nasdaq Industrials Transportation Road and Rail TruckingBaidu Inc BIDU Nasdaq Communication Services Media & Entertainment Interactive Media & Services Interactive Media & ServicesBaijiayun Group Ltd RTC Nasdaq Information Technology Software & Services Software Application SoftwareBank OZK OZK Nasdaq Financials Banks Banks Regional BanksBeacon Roofing Supply Inc BECN Nasdaq Industrials Capital Goods Trading Companies and Distributors Trading Companies and DistributorsBroadcom Inc AVGO Nasdaq Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment SemiconductorsCaesars Entertainment Inc CZR Nasdaq Consumer Discretionary Consumer Services Hotels, Restaurants & Leisure Casinos & GamingCasey's General Stores Inc CASY Nasdaq Consumer Staples Food and Staples Retailing Food and Staples Retailing Food RetailCatalyst Pharmaceuticals Inc CPRX Nasdaq Health Care Pharmaceuticals and Biotechnology Biotechnology BiotechnologyChargepoint Holdings CHPT Nasdaq Industrials Capital Goods Electrical Equipment Electrical Components & EquipmentCheesecake Factory Inc CAKE Nasdaq Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsChina Automotive Systems Inc CAAS Nasdaq Consumer Discretionary Automobiles and Components Auto Components Auto Parts and EquipmentChina Natural Resources Inc CHNR Nasdaq Materials Materials Metals and Mining Diversified Metals and MiningCISCO Systems Inc CSCO Nasdaq Information Technology Technology Hardware & Equipment Communications Equipment Communications EquipmentCognizant Technology Solutions Corp CTSH Nasdaq Information Technology Software and Services IT Services IT Consulting and Other ServicesComcast Corp CMCSA Nasdaq Communication Services Media & Entertainment Media Cable & SatelliteCostco Wholesale Corp COST Nasdaq Consumer Staples Food and Staples Retailing Food and Staples Retailing Hypermarkets and Super CentersDaily Journal Corp DJCO Nasdaq Communication Services Media & Entertainment Media PublishingDollar Tree Inc DLTR Nasdaq Consumer Discretionary Retailing Multiline Retail General Merchandise StoresDropbox Inc DBX Nasdaq Information Technology Software & Services Software Application SoftwareEndo International PLC ENDP Nasdaq Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsETSY Inc ETSY Nasdaq Consumer Discretionary Retailing Internet & Catalog Retail Internet RetailFortinet Inc FTNT Nasdaq Information Technology Software & Services Software Systems SoftwareGenmab A/S GMAB Nasdaq Health Care Pharmaceuticals, Biotechnology & Life Sciences Biotechnology BiotechnologyGibraltar Industries Inc ROCK Nasdaq Industrials Capital Goods Building Products Building ProductsGilead Sciences Inc GILD Nasdaq Health Care Pharmaceuticals and Biotechnology Biotechnology BiotechnologyGlacier Bancorp Inc GBCI Nasdaq Financials Banks Banks Regional BanksGogo Inc GOGO Nasdaq Communication Services Telecommunication Services Wireless Telecommunication Services Wireless Telecommunication ServicesGreat Elm Group Inc GEG Nasdaq Health Care Health Care Equipment and Services Health Care Providers and Services Health Care DistributorsGroupon Inc GRPN Nasdaq Consumer Discretionary Retailing Internet & Direct Marketing Retail Internet & Direct Marketing RetailHarvard Bioscience Inc HBIO Nasdaq Health Care Pharmaceuticals and Biotechnology Life Sciences Tools and Services Life Sciences Tools and ServicesHasbro Inc HAS Nasdaq Consumer Discretionary Consumer Durables and Apparel Leisure Products Leisure ProductsComplete List-By ExchangeHeartland Express Inc HTLD Nasdaq Industrials Transportation Road and Rail TruckingHibbett Inc HIBB Nasdaq Consumer Discretionary Retailing Specialty Retail Specialty StoresIllumina Inc ILMN Nasdaq Health Care Pharmaceuticals and Biotechnology Life Sciences Tools and Services Life Sciences Tools and ServicesInnospec Inc IOSP Nasdaq Materials Materials Chemicals Specialty ChemicalsINTEL Corp INTC Nasdaq Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment SemiconductorsJ&J Snack Foods Corp JJSF Nasdaq Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsJetBlue Airways Corp JBLU Nasdaq Industrials Transportation Airlines AirlinesKaiser Aluminum Corp KALU Nasdaq Materials Materials Metals and Mining AluminumKeurig Dr Pepper Inc KDP Nasdaq Consumer Staples Food, Beverage and Tobacco Beverages Soft DrinksLands' End Inc LE Nasdaq Consumer Discretionary Retailing Internet & Direct Marketing Retail Internet & Direct Marketing RetailLiquidia Corporation LQDA Nasdaq Health Care Pharmaceuticals & Biotechnology Pharmaceuticals PharmaceuticalsLululemon Athletica Inc LULU Nasdaq Consumer Discretionary Consumer Durables and Apparel Textiles, Apparel and Luxury Goods Apparel, Accessories and Luxury GoodsLyft Inc LYFT Nasdaq Industrials Transportation Road and Rail TruckingManhattan Associates Inc MANH Nasdaq Information Technology Software and Services Software Application SoftwareMarriott International Inc MAR Nasdaq Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Hotels, Resorts and Cruise LinesMatch Group Inc MTCH Nasdaq Communication Services Media & Entertainment Interactive Media & Services Interactive Media & ServicesMattel Inc MAT Nasdaq Consumer Discretionary Consumer Durables and Apparel Leisure Products Leisure ProductsMETA META Nasdaq Communication Services Media & Entertainment Interactive Media & Services Interactive Media & ServicesMeta Materials Inc MMAT Nasdaq Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment SemiconductorsMicrosoft Corp MSFT Nasdaq Information Technology Software and Services Software Systems SoftwareMiddlesex Water Co MSEX Nasdaq Utilities Utilities Water Utilities Water UtilitiesMonster Beverage Corp MNST Nasdaq Consumer Staples Food, Beverage and Tobacco Beverages Soft DrinksMyriad Genetics Inc MYGN Nasdaq Health Care Pharmaceuticals and Biotechnology Biotechnology BiotechnologyNational Beverage Corp FIZZ Nasdaq Consumer Staples Food, Beverage and Tobacco Beverages Soft DrinksNetEase Inc NTES Nasdaq Communication Services Media & Entertainment Entertainment Interactive Home EntertainmentNETFLIX Inc NFLX Nasdaq Communication Services Media & Entertainment Entertainment Movies & EntertainmentNorthern Technologies International Corp NTIC Nasdaq Materials Materials Chemicals Specialty ChemicalsNVIDIA Corp NVDA Nasdaq Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment SemiconductorsNXP Semiconductors NV NXPI Nasdaq Information Technology Semiconductors and Semiconductor Equipment Semiconductors and Semiconductor Equipment SemiconductorsOld National Bancorp ONB Nasdaq Financials Banks Banks Regional BanksO'Reilly Automotive Inc ORLY Nasdaq Consumer Discretionary Retailing Specialty Retail Automotive RetailPACCAR Inc PCAR Nasdaq Industrials Capital Goods Machinery Construction Machinery and Heavy TrucksPacwest Bancorp PACW Nasdaq Financials Banks Commerical Banks Regional BanksPapa John's International Inc PZZA Nasdaq Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsPayPal Holdings Inc PYPL Nasdaq Information Technology Software and Services IT Services Data Processing and Outsourced ServicesPeloton Interactive Inc PTON Nasdaq Consumer Discretionary Consumer Durables & Apparel Leisure Equipment & Products Leisure ProductsPepsiCo Inc PEP Nasdaq Consumer Staples Food, Beverage and Tobacco Beverages Soft DrinksPrice (T. ROWE) Group TROW Nasdaq Financials Diversified Financials Capital Markets Asset Management & Custody BanksQUALCOMM Inc QCOM Nasdaq Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment SemiconductorsRBC Bearings Inc ROLL Nasdaq Industrials Capital Goods Machinery Industrial MachineryRegeneron Pharmaceuticals Inc REGN Nasdaq Health Care Pharmaceuticals and Biotechnology Biotechnology BiotechnologyRoyal Gold Inc RGLD Nasdaq Materials Materials Metals and Mining GoldSEI Investments Co SEIC Nasdaq Financials Diversified Financials Capital Markets Asset Management and Custody BanksSirius XM Holdings Inc SIRI Nasdaq Communication Services Media & Entertainment Media Cable & SatelliteSkyWest Inc SKYW Nasdaq Industrials Transportation Airlines AirlinesSmith & Wesson Brands Inc SWBI Nasdaq Consumer Discretionary Consumer Durables and Apparel Leisure Products Leisure ProductsSohu.com Ltd SOHU Nasdaq Communication Services Media & Entertainment Interactive Media & Services Interactive Media & ServicesSolar Edge SEDG Nasdaq Information Technology Semiconductors & Semiconductor Equipment Semiconductor Equipment Computer HardwareSprouts Farmers Market Inc SFM Nasdaq Consumer Staples Food and Staples Retailing Food and Staples Retailing Food RetailStarbucks Corp SBUX Nasdaq Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsStitch Fix Inc SFIX Nasdaq Consumer Discretionary Retailing Internet & Direct Marketing Retail Internet & Direct Marketing RetailTesla Inc TSLA Nasdaq Consumer Discretionary Automobiles and Components Automobiles Automobile ManufacturersTexas Instruments Inc TXN Nasdaq Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment SemiconductorsTexas Roadhouse Inc TXRH Nasdaq Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsThe Middleby Corp MIDD Nasdaq Industrials Capital Goods Machinery Industrial MachineryThe Wendy's Co WEN Nasdaq Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsThe York Water Co YORW Nasdaq Utilities Utilities Water Utilities Water UtilitiesThe9 Ltd NCTY Nasdaq Communication Services Media & Entertainment Entertainment Interactive Home EntertainmentUlta Beauty Inc ULTA Nasdaq Consumer Discretionary Retailing Specialty Retail Specialty StoresUnited States Lime & Minderals Inc. USLM Nasdaq Materials Materials Construction Materials Construction MaterialsUrban Outfitters Inc URBN Nasdaq Consumer Discretionary Retailing Specialty Retail Apparel RetailUTStarcom Holdings Corp UTSI Nasdaq Information Technology Technology Hardware and Equipment Communications Equipment Communications EquipmentVEON Ltd VEON Nasdaq Communication Services Telecommunication Services Wireless Telecommunication Services Wireless Telecommunication ServicesVera Bradley Inc VRA Nasdaq Consumer Discretionary Consumer Durables and Apparel Textiles, Apparel and Luxury Goods Apparel, Accessories and Luxury GoodsVerisk Analytics Inc VRSK Nasdaq Industrials Commercial Services and Supplies Professional Services Research and Consulting ServicesVyant Bio Inc VYNT Nasdaq Health Care Pharmaceuticals, Biotechnology & Life Sciences Biotechnology BiotechnologyWalgreens Boots Alliance Inc WBA Nasdaq Consumer Staples Food & Staples Retailing Food & Staples Retailing Drug RetailWD-40 Co WDFC Nasdaq Consumer Staples Household and Personal Products Household Products Household ProductsAbbott Laboratories ABT New York Stock Exchange, Inc. Health Care Health Care Equipment & Services Health Care Equipment & Supplies Health Care EquipmentAbbVie Inc ABBV New York Stock Exchange, Inc. Health Care Pharmaceuticals and Biotechnology Biotechnology BiotechnologyAbercrombie & Fitch Co ANF New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Apparel RetailComplete List-By ExchangeAflac Inc AFL New York Stock Exchange, Inc. Financials Insurance Insurance Life and Health InsuranceAir Products & Chemicals Inc APD New York Stock Exchange, Inc. Materials Materials Chemicals Industrial GasesAlibaba Group Holding Ltd BABA New York Stock Exchange, Inc. Consumer Discretionary Retailing Internet & Direct Marketing Retail Internet & Direct Marketing RetailAllstate Corp ALL New York Stock Exchange, Inc. Financials Insurance Insurance Property and Casualty InsuranceAMC Entertainment Holdings AMC New York Stock Exchange, Inc. Communication Services Media & Entertainment Entertainment Movies & EntertainmentAmerican Eagle Outfitters Inc AEO New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Apparel RetailAmerican Express Co AXP New York Stock Exchange, Inc. Financials Diversified Financials Consumer Finance Consumer FinanceAmerican Water Works Co Inc AWK New York Stock Exchange, Inc. Utilities Utilities Water Utilities Water UtilitiesAMN Healthcare Services Inc AMN New York Stock Exchange, Inc. Health Care Health Care Equipment and Services Health Care Providers and Services Health Care ServicesAptiv PLC APTV New York Stock Exchange, Inc. Consumer Discretionary Automobiles and Components Auto Components Auto Parts and EquipmentArista Networks Inc ANET New York Stock Exchange, Inc. Information Technology Technology Hardware and Equipment Communications Equipment Communications EquipmentArtisan Partners Asset Management Inc APAM New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Asset Management and Custody BanksASGN Inc ASGN New York Stock Exchange, Inc. Industrials Commercial Services and Supplies Professional Services Human Resource and Employment ServicesAshland Global Holdings Inc ASH New York Stock Exchange, Inc. Materials Materials Chemicals Specialty ChemicalsAT&T Inc T New York Stock Exchange, Inc. Communication Services Telecommunication Services Diversified Telecommunication Services Integrated Telecommunication ServicesAutozone Inc AZO New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Automotive RetailBank of America Corp BAC New York Stock Exchange, Inc. Financials Banks Commercial Banks Diversified BanksBarclays PLC BCS New York Stock Exchange, Inc. Financials Banks Banks Diversified BanksBarnes & Noble Education Inc BNED New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Specialty StoresBaxter International Inc BAX New York Stock Exchange, Inc. Health Care Health Care Equipment and Services Health Care Equipment and Supplies Health Care EquipmentBest Buy Co Inc BBY New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Computer and Electronics RetailBill.com Holdings Inc BILL New York Stock Exchange, Inc. Information Technology Software & Services Software Application SoftwareBlackrock Inc BLK New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Asset Management & Custody BanksBlackstone Inc BX New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Asset Management and Custody BanksBoeing Co BA New York Stock Exchange, Inc. Industrials Capital Goods Aerospace and Defense Aerospace and DefenseBorgWarner Inc BWA New York Stock Exchange, Inc. Consumer Discretionary Automobiles and Components Auto Components Auto Parts and EquipmentBP PLC BP New York Stock Exchange, Inc. Energy Energy Oil, Gas and Consumable Fuels Integrated Oil and GasBristol-Myers Squibb Co BMY New York Stock Exchange, Inc. Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsBrookfield Asset Management BAM New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Asset Management & Custody BanksBuild-A-Bear Workshop Inc BBW New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Specialty StoresBurlington Stores Inc BURL New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Apparel RetailCameco Corp CCJ New York Stock Exchange, Inc. Energy Energy Oil, Gas and Consumable Fuels Coal and Consumable FuelsCampbell Soup Co CPB New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsCanadian National Railway Co CNI New York Stock Exchange, Inc. Industrials Transportation Road & Rails RailroadsCanadian Pacific Railway Ltd CP New York Stock Exchange, Inc. Industrials Transportation Road & Rails RailroadsCarMax Inc KMX New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Automotive RetailCaterpillar Inc CAT New York Stock Exchange, Inc. Industrials Capital Goods Machinery Construction & Farm Machinery & Heavy TrucksCentene Corp CNC New York Stock Exchange, Inc. Health Care Health Care Equipment and Services Health Care Providers and Services Managed Health CareChevron Corp CVX New York Stock Exchange, Inc. Energy Energy Oil, Gas and Consumable Fuels Integrated Oil and GasChina Yuchai International Ltd CYD New York Stock Exchange, Inc. Industrials Capital Goods Machinery Construction Machinery and Heavy TrucksChipotle Mexican Grill Inc CMG New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsCitigroup Inc C New York Stock Exchange, Inc. Financials Banks Banks Diversified BanksClearwater Paper Corp CLW New York Stock Exchange, Inc. Materials Materials Paper and Forest Products Paper ProductsCoca-Cola Co KO New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Beverages Soft DrinksColgate-Palmolive Co CL New York Stock Exchange, Inc. Consumer Staples Household and Personal Products Household Products Household ProductsCorteva Inc CTVA New York Stock Exchange, Inc. Materials Materials Chemicals Fertilizers and Agricultural ChemicalsCVS Health Corp CVS New York Stock Exchange, Inc. Health Care Health Care Equipment and Services Health Care Providers and Services Health Care ServicesDeere & Co DE New York Stock Exchange, Inc. Industrials Capital Goods Machinery Agricultural & Farm MachineryDelta Air Lines Inc DAL New York Stock Exchange, Inc. Industrials Transportation Airlines AirlinesDeutsche Bank AG DB New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Diversified Capital MarketsDiageo PLC DEO New York Stock Exchange, Inc. Consumer Staples Food, Beverage & Tobacco Beverages Distillers & VintnersDigital Realty Trust Inc DLR New York Stock Exchange, Inc. Real Estate Real Estate Equity Real Estate Investment Trusts (REITs) Specialized REITsDiscover Financial Services DFS New York Stock Exchange, Inc. Financials Diversified Financials Consumer Finance Consumer FinanceDollar General Corp DG New York Stock Exchange, Inc. Consumer Discretionary Retailing Multiline Retail General Merchandise StoresDominion Energy Inc D New York Stock Exchange, Inc. Utilities Utilities Multi-Utilities Multi-UtilitiesDouglas Dynamics Inc PLOW New York Stock Exchange, Inc. Industrials Capital Goods Machinery Construction Machinery and Heavy TrucksDXC Technology Co DXC New York Stock Exchange, Inc. Information Technology Software and Services IT Services IT Consulting and Other ServicesEastman Chemical Co EMN New York Stock Exchange, Inc. Materials Materials Chemicals Diversified ChemicalsEnbridge Inc ENB New York Stock Exchange, Inc. Energy Energy Oil, Gas & Consumable Fuels Oil & Gas Storage & TransportationEndeavor Group Holdings EDR New York Stock Exchange, Inc. Communication Services Media & Entertainment Entertainment Movies & EntertainmentEnergy Transfer LP ET New York Stock Exchange, Inc. Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Storage and TransportationExtra Space Storage Inc EXR New York Stock Exchange, Inc. Real Estate Real Estate Equity Real Estate Investment Trusts (REITs) Specialized REITsExxon Mobil Corp XOM New York Stock Exchange, Inc. Energy Energy Oil, Gas and Consumable Fuels Integrated Oil and GasFair Isaac Corp FICO New York Stock Exchange, Inc. Information Technology Software and Services Software Application SoftwareFirstEnergy Corp FE New York Stock Exchange, Inc. Utilities Utilities Electric Utilities Electric UtilitiesFMC Corp FMC New York Stock Exchange, Inc. Materials Materials Chemicals Fertilizers and Agricultural ChemicalsFoot Locker Inc FL New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Apparel RetailFord Motor Co F New York Stock Exchange, Inc. Consumer Discretionary Automobiles and Components Automobiles Automobile ManufacturersFortis Inc FTS New York Stock Exchange, Inc. Utilities Utilities Electric Utilities Electric UtilitiesFranklin Resources Inc BEN New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Asset Management & Custody BanksFreeport-McMoRan Inc FCX New York Stock Exchange, Inc. Materials Materials Metals and Mining CopperComplete List-By ExchangeFTI Consulting Inc FCN New York Stock Exchange, Inc. Industrials Commercial Services and Supplies Professional Services Research and Consulting ServicesGap Inc GPS New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Apparel RetailGarmin Ltd GRMN New York Stock Exchange, Inc. Consumer Discretionary Consumer Durables & Apparel Household Durables Consumer ElectronicsGeneral Dynamics Corp GD New York Stock Exchange, Inc. Industrials Capital Goods Aerospace & Defense Aerospace & DefenseGeneral Electric Co GE New York Stock Exchange, Inc. Industrials Capital Goods Industrial Conglomerates Industrial ConglomeratesGeneral Mills Inc GIS New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsGeneral Motors Co GM New York Stock Exchange, Inc. Consumer Discretionary Automobiles and Components Automobiles Automobile ManufacturersGlaxoSmithKline PLC GSK New York Stock Exchange, Inc. Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsGlobus Medical Inc GMED New York Stock Exchange, Inc. Health Care Health Care Equipment and Services Health Care Equipment and Supplies Health Care EquipmentGoldman Sachs Group Inc GS New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Investment Banking & BrokerageH&R Block Inc HRB New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Diversified Consumer Services Specialized Consumer ServicesHarley-Davidson Inc HOG New York Stock Exchange, Inc. Consumer Discretionary Automobiles and Components Automobiles Motorcycle ManufacturersHess Corp HES New York Stock Exchange, Inc. Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Exploration and ProductionHome Depot Inc HD New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Home Improvement RetailHonda Motor Co Ltd HMC New York Stock Exchange, Inc. Consumer Discretionary Automobiles and Components Automobiles Automobile ManufacturersHyatt Hotels Corp H New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Hotels, Resorts and Cruise LinesImax Corp IMAX New York Stock Exchange, Inc. Communication Services Media & Entertainment Entertainment Movies & EntertainmentIntercontinental Exchange Inc ICE New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Financial Exchanges & DataIQVIA Holdings Inc IQV New York Stock Exchange, Inc. Health Care Pharmaceuticals, Biotechnology & Life Sciences Life Sciences Tools & Services Life Sciences Tools & ServicesIron Mountain Inc IRM New York Stock Exchange, Inc. Real Estate Real Estate Equity Real Estate Investment Trusts (REITs) Specialized REITsJohnson & Johnson JNJ New York Stock Exchange, Inc. Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsJPMorgan Chase & Co JPM New York Stock Exchange, Inc. Financials Banks Banks Diversified BanksKellogg Co K New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsKeyCorp KEY New York Stock Exchange, Inc. Financials Banks Banks Regional BanksKinder Morgan Inc KMI New York Stock Exchange, Inc. Energy Energy Oil, Gas & Consumable Fuels Oil & Gas Storage & TransportationKKR & Co Inc KKR New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Asset Management and Custody BanksLas Vegas Sands Corp LVS New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Casinos and GamingLazard Ltd LAZ New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Investment Banking and BrokerageLCI Industries Inc LCII New York Stock Exchange, Inc. Consumer Discretionary Automobiles and Components Auto Components Auto Parts and EquipmentLockheed Martin Corp LMT New York Stock Exchange, Inc. Industrials Capital Goods Aerospace and Defense Aerospace and DefenseLoews Corp L New York Stock Exchange, Inc. Financials Insurance Insurance Property and Casualty InsuranceLowe's Companies Inc LOW New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Home Improvement RetailM&T Bank Corp MTB New York Stock Exchange, Inc. Financials Banks Banks Regional BanksMacy's Inc M New York Stock Exchange, Inc. Consumer Discretionary Retailing Multiline Retail Department StoresMastercard Inc MA New York Stock Exchange, Inc. Information Technology Software and Services IT Services Data Processing and Outsourced ServicesMcCormick & Co Inc MKC New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsMcDonald's Corp MCD New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsMcKesson Corp MCK New York Stock Exchange, Inc. Health Care Health Care Equipment and Services Health Care Providers and Services Health Care DistributorsMerck & Co Inc MRK New York Stock Exchange, Inc. Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsMetLife Inc MET New York Stock Exchange, Inc. Financials Insurance Insurance Life and Health InsuranceMolson Coors Beverage Co TAP New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Beverages BrewersMoody's Corporation MCO New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Financial Exchanges & DataMorgan Stanley MS New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Investment Banking & BrokerageMovado Group Inc MOV New York Stock Exchange, Inc. Consumer Discretionary Consumer Durables and Apparel Textiles, Apparel and Luxury Goods Apparel, Accessories and Luxury GoodsNational Fuel Gas Co NFG New York Stock Exchange, Inc. Utilities Utilities Gas Utilities Gas UtilitiesNatural Gas Services Group Inc NGS New York Stock Exchange, Inc. Energy Energy Energy Equipment and Services Oil and Gas Equipment and ServicesNew Oriental Education & Technology Group Inc EDU New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Diversified Consumer Services Education ServicesNike Inc NKE New York Stock Exchange, Inc. Consumer Discretionary Consumer Durables and Apparel Textiles, Apparel and Luxury Goods FootwearNorthrop Grumman Corp NOC New York Stock Exchange, Inc. Industrials Capital Goods Aerospace & Defense Aerospace & DefenseNorwegian Cruise Line Holdings Ltd NCLH New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Hotels, Resorts and Cruise LinesNOV Inc NOV New York Stock Exchange, Inc. Energy Energy Energy Equipment & Services Oil & Gas Equipment & ServicesNovartis AG NVS New York Stock Exchange, Inc. Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsNutrien Ltd NTR New York Stock Exchange, Inc. Materials Materials Chemicals Fertilizers & Agricultural ChemicalsONEOK Inc OKE New York Stock Exchange, Inc. Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Storage and TransportationOppenheimer Holdings Inc OPY New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Investment Banking and BrokerageOracle Corp ORCL New York Stock Exchange, Inc. Information Technology Software and Services Software Systems SoftwarePfizer Inc PFE New York Stock Exchange, Inc. Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsPG&E Corp PCG New York Stock Exchange, Inc. Utilities Utilities Electric Utilities Electric UtilitiesPhillips 66 PSX New York Stock Exchange, Inc. Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Refining and MarketingPhysicians Realty Trust DOC New York Stock Exchange, Inc. Real Estate Real Estate Equity Real Estate Investment Trusts (REITs) Health Care REITsPlanet Fitness Inc PLNT New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Leisure FacilitiesPNC Financial Services Group Inc PNC New York Stock Exchange, Inc. Financials Banks Banks Regional BanksPOSCO PKX New York Stock Exchange, Inc. Materials Materials Metals and Mining SteelPrestige Consumer Healthcare Inc PBH New York Stock Exchange, Inc. Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsProcter & Gamble Co PG New York Stock Exchange, Inc. Consumer Staples Household and Personal Products Household Products Household ProductsPrudential Financial Inc PRU New York Stock Exchange, Inc. Financials Insurance Insurance Life and Health InsurancePublic Storage PSA New York Stock Exchange, Inc. Real Estate Real Estate Equity Real Estate Investment Trusts (REITs) Specialized REITsQuaker Chemical Corp KWR New York Stock Exchange, Inc. Materials Materials Chemicals Specialty ChemicalsRaytheon Technologies Corp RTX New York Stock Exchange, Inc. Industrials Capital Goods Aerospace & Defense Aerospace & DefenseRegions Financial Corp RF New York Stock Exchange, Inc. Financials Banks Banks Regional BanksRitchie Bros Auctioneers Inc RBA New York Stock Exchange, Inc. Industrials Commercial Services and Supplies Commercial Services and Supplies Diversified Support ServicesComplete List-By ExchangeRite Aid Corp RAD New York Stock Exchange, Inc. Consumer Staples Food and Staples Retailing Food and Staples Retailing Drug RetailRogers Communications-CL B RCI New York Stock Exchange, Inc. Communication Services Telecommunication Services Wireless Telecommunication Services Wireless Telecommunication ServicesSalesforce Inc CRM New York Stock Exchange, Inc. Information Technology Software & Services Software Application SoftwareSAP SE SAP New York Stock Exchange, Inc. Information Technology Software & Services Software Application SoftwareSempra Energy SRE New York Stock Exchange, Inc. Utilities Utilities Multi-Utilities Multi-UtilitiesSJW Group SJW New York Stock Exchange, Inc. Utilities Utilities Water Utilities Water UtilitiesSnap-on Inc SNA New York Stock Exchange, Inc. Industrials Capital Goods Machinery Industrial MachinerySnowflake Inc SNOW New York Stock Exchange, Inc. Information Technology Software & Services IT Services Internet Services & InfrastructureSONY Group Corporation SONY New York Stock Exchange, Inc. Consumer Discretionary Consumer Durables & Apparel Household Durables Consumer ElectronicsSouthern Co SO New York Stock Exchange, Inc. Utilities Utilities Electric Utilities Electric UtilitiesSouthwest Airlines Co LUV New York Stock Exchange, Inc. Industrials Transportation Airlines AirlinesSpirit Airlines Inc SAVE New York Stock Exchange, Inc. Industrials Transportation Airlines AirlinesSpotify Technology SA SPOT New York Stock Exchange, Inc. Communication Services Media & Entertainment Entertainment Movies & EntertainmentSunoco LP SUN New York Stock Exchange, Inc. Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Refining and MarketingSysco Corp SYY New York Stock Exchange, Inc. Consumer Staples Food and Staples Retailing Food and Staples Retailing Food DistributorsTaiwan Semiconductor Manufacturing Co TSM New York Stock Exchange, Inc. Information Technology Semiconductors & Semiconductor Equipment Semiconductors & Semiconductor Equipment SemiconductorsTAL Education Group TAL New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Diversified Consumer Services Education ServicesTarget Corp TGT New York Stock Exchange, Inc. Consumer Discretionary Retailing Multiline Retail General Merchandise StoresTC Energy Corp TRP New York Stock Exchange, Inc. Energy Energy Oil, Gas & Consumable Fuels Oil & Gas Storage & TransportationTELUS Corp TU New York Stock Exchange, Inc. Communication Services Telecommunication Services Diversified Telecommunication Services Integrated Telecommunication ServicesTeva Pharmaceutical Industries Ltd TEVA New York Stock Exchange, Inc. Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsThe Container Store Group Inc TCS New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Specialty StoresThe Estee Lauder Companies Inc EL New York Stock Exchange, Inc. Consumer Staples Household and Personal Products Personal Products Personal ProductsThe GEO Group Inc GEO New York Stock Exchange, Inc. Real Estate Real Estate Equity Real Estate Investment Trusts (REITs) Specialized REITsThe Hershey Co HSY New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsThe Walt Disney Co DIS New York Stock Exchange, Inc. Communication Services Media & Entertainment Entertainment Movies & EntertainmentTitan International Inc TWI New York Stock Exchange, Inc. Industrials Capital Goods Machinery Agricultural and Farm MachineryTJX Companies Inc TJX New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Apparel RetailTootsie Roll Industries Inc TR New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsToyota Motor Corp TM New York Stock Exchange, Inc. Consumer Discretionary Automobiles and Components Automobiles Automobile ManufacturersTreehouse Foods Inc THS New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsTREX Co Inc TREX New York Stock Exchange, Inc. Industrials Capital Goods Building Products Building ProductsTyson Foods Inc TSN New York Stock Exchange, Inc. Consumer Staples Food, Beverage and Tobacco Food Products Packaged Foods and MeatsUber Technologies Inc UBER New York Stock Exchange, Inc. Industrials Transportation Road and Rail TruckingUBS Group AG UBS New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Diversified Capital MarketsUGI Corp UGI New York Stock Exchange, Inc. Utilities Utilities Gas Utilities Gas UtilitiesUnder Armour Inc UAA New York Stock Exchange, Inc. Consumer Discretionary Consumer Durables and Apparel Textiles, Apparel and Luxury Goods Apparel, Accessories and Luxury GoodsUnilever PLC UL New York Stock Exchange, Inc. Consumer Staples Household and Personal Products Personal Products Personal ProductsUnited Natural Foods Inc UNFI New York Stock Exchange, Inc. Consumer Staples Food and Staples Retailing Food and Staples Retailing Food DistributorsUnited States Steel Corp X New York Stock Exchange, Inc. Materials Materials Metals and Mining SteelUnitedHealth Group Inc UNH New York Stock Exchange, Inc. Health Care Health Care Equipment and Services Health Care Providers and Services Managed Health CareVeeva Systems Inc VEEV New York Stock Exchange, Inc. Health Care Health Care Equipment & Services Health Care Technology Health Care TechnologyVerizon Communications Inc VZ New York Stock Exchange, Inc. Communication Services Telecommunication Services Diversified Telecommunication Services Integrated Telecommunication ServicesVF Corp VFC New York Stock Exchange, Inc. Consumer Discretionary Consumer Durables and Apparel Textiles, Apparel and Luxury Goods Apparel, Accessories and Luxury GoodsVisa Inc V New York Stock Exchange, Inc. Information Technology Software and Services IT Services Data Processing and Outsourced ServicesWabash National Corp WNC New York Stock Exchange, Inc. Industrials Capital Goods Machinery Construction Machinery and Heavy TrucksWalmart Inc WMT New York Stock Exchange, Inc. Consumer Staples Food & Staples Retailing Food & Staples Retailing Hypermarkets & Super CentersWells Fargo & Co WFC New York Stock Exchange, Inc. Financials Banks Banks Diversified BanksWilliams-Sonoma Inc WSM New York Stock Exchange, Inc. Consumer Discretionary Retailing Specialty Retail Homefurnishing RetailWyndham Hotels & Resorts Inc WH New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure Hotels, Resorts and Cruise LinesXerox Holdings Corp XRX New York Stock Exchange, Inc. Information Technology Technology Hardware & Equipment Technology Hardware, Storage & Peripherals Technology Hardware, Storage & PeripheralsYum Brands Inc YUM New York Stock Exchange, Inc. Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsZTO Express (Cayman) Inc ZTO New York Stock Exchange, Inc. Industrials Transportation Air Freight and Logistics Air Freight and LogisticsAnheuser-Bush InBev SA/NV BUD New York Stock Exchange, Inc. Consumer Staples Food, Beverage & Tobacco Beverages BrewersCactus Inc. WHD New York Stock Exchange, Inc. Energy Energy Energy Equipment & Services Oil & Gas Equipment & ServicesCharles Schwab SCHW New York Stock Exchange, Inc. Financials Diversified Financials Capital Markets Investment Banking & BrokerageCRH PLC CRH New York Stock Exchange, Inc. Materials Materials Construction Materials Construction MaterialsDow Chemical Company DOW New York Stock Exchange, Inc. Materials Materials Chemicals Commodity ChemicalsLithium Americas LAC New York Stock Exchange, Inc. Materials Materials Metals & Mining Diversified Metals & MiningNovo Nordisk NVO New York Stock Exchange, Inc. Health Care Pharmaceuticals & Biotechnology Pharmaceuticals PharmaceuticalsTextron Systems TXT New York Stock Exchange, Inc. Industrials Capital Goods Aerospace & Defense Aerospace & DefenseUnited Parcel Service UPS New York Stock Exchange, Inc. Industrials Transportation Air Freight & Logistics Air Freight & LogisticsChina Tourism Group Duty Free Corp Ltd 601888 Shanghai Stock Exchange Consumer Discretionary Retailing Specialty Retail Specialty StoresChina World Trade Center Co Ltd 600007 Shanghai Stock Exchange Real Estate Real Estate Real Estate Management & Development Real Estate Operating CompaniesChina Yangtze Power Co Ltd 600900 Shanghai Stock Exchange Utilities Utilities Independent Power and Renewable Electricity Producers Renewable ElectricityFoxconn Industrial Internet Co Ltd 601138 Shanghai Stock Exchange Information Technology Technology Hardware and Equipment Electronic Equipment, Instruments and Components Electronic Manufacturing ServicesJiangsu Hengrui Pharmaceuticals Co Ltd 600276 Shanghai Stock Exchange Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsKweichow Moutai Co Ltd 600519 Shanghai Stock Exchange Consumer Staples Food, Beverage and Tobacco Beverages Distillers and VintnersShanghai International Airport Co Ltd 600009 Shanghai Stock Exchange Industrials Transportation Transportation Infrastructure Airport ServicesBank Of Ningbo Co Ltd 002142 Shenzhen Stock Exchange Financials Banks Banks Regional BanksChina Vanke Co Ltd 000002 Shenzhen Stock Exchange Real Estate Real Estate Real Estate Management & Development Real Estate DevelopmentComplete List-By ExchangeHangzhou Hik-Vision Digital Technology Co Ltd 002415 Shenzhen Stock Exchange Information Technology Technology Hardware and Equipment Electronic Equipment, Instruments and Components Electronic Equipment and InstrumentsMidea Group Co Ltd 000333 Shenzhen Stock Exchange Consumer Discretionary Consumer Durables and Apparel Household Durables Household AppliancesShenzhen Mindray Bio-Medical Electronics Co Ltd 300760 Shenzhen Stock Exchange Health Care Health Care Equipment and Services Health Care Equipment and Supplies Health Care EquipmentWuliangye Yibin Co Ltd 000858 Shenzhen Stock Exchange Consumer Staples Food, Beverage and Tobacco Beverages Distillers and VintnersNestle SA NESN SIX Swiss Exchange Consumer Staples Food, Beverage & Tobacco Food Products Packaged Foods & MeatsRoche Holding AG ROG SIX Swiss Exchange Health Care Pharmaceuticals & Biotechnology Pharmaceuticals 35202010Agnico Eagle Mines AEM Toronto Stock Exchange Materials Materials Metals and Mining GoldAir Canada AC Toronto Stock Exchange Industrials Transportation Airlines AirlinesAlimentation Couche-Tard Inc ATD Toronto Stock Exchange Consumer Staples Food and Staples Retailing Food and Staples Retailing Food RetailAurora Cannabis Inc ACB Toronto Stock Exchange Health Care Pharmaceuticals and Biotechnology Pharmaceuticals PharmaceuticalsBank of Nova Scotia BNS Toronto Stock Exchange Financials Banks Banks Diversified BanksBCE Inc BCE Toronto Stock Exchange Communication Services Telecommunication Services Diversified Telecommunication Services Integrated Telecommunication ServicesBombardier Inc BBD.B Toronto Stock Exchange Industrials Capital Goods Aerospace and Defense Aerospace and DefenseBoyd Group Services Inc BYD Toronto Stock Exchange Industrials Commercial Services and Supplies Commercial Services and Supplies Diversified Support ServicesCanada Goose Holdings Inc GOOS Toronto Stock Exchange Consumer Discretionary Consumer Durables and Apparel Textiles, Apparel and Luxury Goods Apparel, Accessories and Luxury GoodsCanadian Natural Resources Ltd CNQ Toronto Stock Exchange Energy Energy Oil, Gas and Consumable Fuels Oil and Gas Exploration and ProductionCanadian Utilities Ltd CU Toronto Stock Exchange Utilities Utilities Multi-Utilities Multi-UtilitiesCanadian Western Bank CWB Toronto Stock Exchange Financials Banks Banks Regional BanksCargojet Inc CJT Toronto Stock Exchange Industrials Transportation Air Freight and Logistics Air Freight and LogisticsConstellation Software Inc CSU Toronto Stock Exchange Information Technology Software and Services Software Application SoftwareDollarama Inc DOL Toronto Stock Exchange Consumer Discretionary Retailing Multiline Retail General Merchandise StoresEnghouse Systems Ltd ENGH Toronto Stock Exchange Information Technology Software and Services Software Application SoftwareFairfax Financial Holdings Ltd FFH Toronto Stock Exchange Financials Insurance Insurance Multi-line InsuranceGreat-West Lifeco Inc GWO Toronto Stock Exchange Financials Insurance Insurance Life and Health InsuranceOpen Text Corp OTEX Toronto Stock Exchange Information Technology Software and Services Software Application SoftwareRestaurant Brands International Inc QSR Toronto Stock Exchange Consumer Discretionary Consumer Services Hotels, Restaurants and Leisure RestaurantsRoyal Bank of Canada RY Toronto Stock Exchange Financials Banks Commercial Banks Diversified BanksShopify Inc SHOP Toronto Stock Exchange Information Technology Software and Services IT Services Internet Services & InfrastructureSuncor Energy Inc SU Toronto Stock Exchange Energy Energy Oil, Gas and Consumable Fuels Integrated Oil and Gas

ETFS

SPY SPDR S&P 500 ETF TRUST Equity Large-cap Blend N.A. United States N.A. N.A. 408141.156 0.094 22.04 NIVV ISHARES CORE S&P 500 ETF Equity Large-cap Blend N.A. United States N.A. N.A. 326402.656 0.03 22.09 NVOO VANGUARD S&P 500 ETF Equity Large-cap Blend N.A. United States N.A. N.A. 312579.156 0.03 22.01 NVTI VANGUARD TOTAL STOCK MKT ETF Equity Broad Market Blend N.A. United States N.A. N.A. 305993.094 0.03 21.95 NQQQ INVESCO QQQ TRUST SERIES 1 Equity Large-cap Growth N.A. United States N.A. N.A. 198268.641 0.2 28.51 NVTV VANGUARD VALUE ETF Equity Large-cap Value N.A. United States N.A. N.A. 101583.875 0.04 20.32 NVUG VANGUARD GROWTH ETF Equity Large-cap Growth N.A. United States N.A. N.A. 93329.258 0.04 27.01 NIWF ISHARES RUSSELL 1000 GROWTH Equity Large-cap Growth N.A. United States N.A. N.A. 70317.773 0.18 24.89 NVIG VANGUARD DIVIDEND APPREC ETF Equity Large-cap Value N.A. United States N.A. N.A. 67956.875 0.06 19.64 NIJH ISHARES CORE S&P MIDCAP ETF Equity Mid-cap Blend N.A. United States N.A. N.A. 67818.766 0.05 25.48 NIJR ISHARES CORE S&P SMALL-CAP E Equity Small-cap Blend N.A. United States N.A. N.A. 67374.562 0.06 26.13 NIWM ISHARES RUSSELL 2000 ETF Equity Small-cap Blend N.A. United States N.A. N.A. 56930.535 0.19 25.09 NVO VANGUARD MID-CAP ETF Equity Mid-cap Blend N.A. United States N.A. N.A. 55134.988 0.04 23.42 NIWD ISHARES RUSSELL 1000 VALUE E Equity Large-cap Value N.A. United States N.A. N.A. 50664.828 0.18 21.33 NVYM VANGUARD HIGH DVD YIELD ETF Equity Large-cap Value N.A. United States N.A. N.A. 48639.734 0.06 20.81 NSCHD SCHWAB US DVD EQUITY ETF Equity Large-cap Value N.A. United States N.A. N.A. 47633.57 0.06 19.68 NRSP INVESCO S&P 500 EQUAL WEIGHT Equity Large-cap Blend N.A. United States N.A. N.A. 36330.633 0.2 23.35 NQUAL ISHARES MSCI USA QUALITY FAC Equity Large-cap Blend N.A. United States N.A. N.A. 31083.43 0.15 24.02 NUSMV ISHARES MSCI USA MIN VOL FAC Equity Large-cap Blend N.A. United States N.A. N.A. 28533.461 0.15 16.46 NJEPI JPMORGAN EQUITY PREMIUM INCO Equity Broad Market Value N.A. United States N.A. N.A. 26639.4 0.35 14.47 YDGRO ISHARES CORE DIVIDEND GROWTH Equity Broad Market Blend N.A. United States N.A. N.A. 23432.83 0.08 19.86 NCOWZ PACER US CASH COWS 100 ETF Equity Broad Market Value N.A. United States N.A. N.A. 13012.707 0.49 27.29 NNOBL PROSHARES S&P 500 DIVIDEND A Equity Large-cap Value N.A. United States N.A. N.A. 11348.859 0.35 21.14 NMOAT VANECK MORNINGSTAR WIDE MOAT Equity Large-cap Blend N.A. United States N.A. N.A. 10923.277 0.46 25.45 NMTUM ISHARES MSCI USA MOMENTUM FA Equity Large-cap Growth N.A. United States N.A. N.A. 9143.5 0.15 19.16 NARKK ARK INNOVATION ETF Equity Broad Market Blend N.A. United States N.A. N.A. 8146.339 0.75 43.79 YAVUV AVANTIS US SMALL CAP VALUE Equity Small-cap Value N.A. United States N.A. N.A. 5898.964 0.25 31.01 YBND VANGUARD TOTAL BOND MARKET Fixed Income N.A. Aggregate N.A. United States N.A. Investment Grade BBB or higher 92981.016 0.03 9.1 NAGG ISHARES CORE U.S. AGGREGATE Fixed Income N.A. Aggregate N.A. United States N.A. Investment Grade BBB or higher 90798.805 0.03 9.27 NBNDX VANGUARD TOTAL INTL BOND ETF Fixed Income N.A. Aggregate N.A. International N.A. Investment Grade BBB or higher 49376.227 0.07 8.28 NVCIT VANGUARD INT-TERM CORPORATE Fixed Income N.A. Corporate N.A. United States Intermediate Investment Grade BBB or higher 39295.602 0.04 11.64 NTLT ISHARES 20+ YEAR TREASURY BO Fixed Income N.A. Government N.A. United States Long-Term Investment Grade A or higher 38808.281 0.15 18.05 NBSV VANGUARD SHORT-TERM BOND ETF Fixed Income N.A. Aggregate N.A. United States Short-Term Investment Grade BBB or higher 36718.41 0.04 4.18 NLQD ISHARES IBOXX INVESTMENT GRA Fixed Income N.A. Corporate N.A. United States N.A. Investment Grade BBB or higher 35151.824 0.14 14.68 NVCSH VANGUARD S/T CORP BOND ETF Fixed Income N.A. Corporate N.A. United States Short-Term Investment Grade BBB or higher 34855.902 0.04 5.11 NMUB ISHARES NATIONAL MUNI BOND E Fixed Income N.A. Municipals N.A. United States N.A. Investment Grade BBB or higher 32288.637 0.07 8.27 NIEF ISHARES 7-10 YEAR TREASURY B Fixed Income N.A. Government N.A. United States Long-Term Investment Grade A or higher 28999.99 0.15 10.64 NBIL SPDR BLOOMBERG 1-3 MONTH T-B Fixed Income N.A. Government N.A. United States Ultra Short Investment Grade A or higher 28851.029 0.135 0.43 NSHY ISHARES 1-3 YEAR TREASURY BO Fixed Income N.A. Government N.A. United States Short-Term Investment Grade A or higher 27868.43 0.15 2.82 NVTEB VANGUARD TAX-EXEMPT BOND ETF Fixed Income N.A. Municipals N.A. United States Intermediate Investment Grade BBB or higher 27251.98 0.05 8.76 NMBB ISHARES MBS ETF Fixed Income N.A. Mortgage-Backed N.A. United States N.A. Investment Grade A or higher 27161.418 0.04 10.16 NGOVT ISHARES US TREASURY BOND ETF Fixed Income N.A. Government N.A. United States Intermediate Investment Grade A or higher 26694.381 0.05 7.62 NJPST JPMORGAN ULTRA-SHORT INCOME Fixed Income N.A. Aggregate N.A. Global Ultra Short Investment Grade BBB or higher 24198.221 0.18 0.68 YIGSB ISHARES 1-5Y INV GRADE CORP Fixed Income N.A. Corporate N.A. United States Short-Term Investment Grade BBB or higher 23373.18 0.04 4.94 NIUSB ISHARES CORE TOTAL BOND ETF Fixed Income N.A. Aggregate N.A. Global N.A. Investment Grade BBB or higher 22511.699 0.06 9.49 NVGSH VANGUARD SHORT-TERM TREASURY Fixed Income N.A. Government N.A. United States Short-Term Investment Grade A or higher 22349.67 0.04 2.79 NTIP ISHARES TIPS BOND ETF Fixed Income N.A. Inflation Protected N.A. United States Intermediate Investment Grade A or higher 21528.617 0.19 10.57 NSHV ISHARES SHORT TREASURY BOND Fixed Income N.A. Government N.A. United States Ultra Short Investment Grade A or higher 19787.529 0.15 0.58 NHYG ISHARES IBOXX HIGH YLD CORP Fixed Income N.A. Corporate N.A. United States N.A. High Yield 16501.67 0.48 13.84 NEMB ISHARES JP MORGAN USD EMERGI Fixed Income N.A. Government N.A. International Intermediate N.A. 14776.01 0.39 15.89 NVGT VANGUARD INFO TECH ETF Equity Large-cap Growth Technology United States N.A. N.A. 53251.133 0.1 29.8 NXLK TECHNOLOGY SELECT SECT SPDR Equity Large-cap Growth Technology United States N.A. N.A. 50784.117 0.1 30.64 NXLV HEALTH CARE SELECT SECTOR Equity Large-cap Blend Health Care United States N.A. N.A. 40402.422 0.1 15.95 NXLE ENERGY SELECT SECTOR SPDR Equity Large-cap Blend Energy United States N.A. N.A. 34069.004 0.1 37.41 NVNQ VANGUARD REAL ESTATE ETF Equity Broad Market Blend Real Estate United States N.A. N.A. 32145.061 0.12 24.55 NXLF FINANCIAL SELECT SECTOR SPDR Equity Large-cap Blend Financial United States N.A. N.A. 31042.051 0.1 25.97 NXLP CONSUMER STAPLES SPDR Equity Large-cap Blend Consumer Staples United States N.A. N.A. 17786.23 0.1 17.69 NXLY CONSUMER DISCRETIONARY SELT Equity Large-cap Growth Consumer Discretionary United States N.A. N.A. 16978.51 0.1 31.81 NVHT VANGUARD HEALTH CARE ETF Equity Broad Market Blend Health Care United States N.A. N.A. 16763.199 0.1 15.17 NXLI INDUSTRIAL SELECT SECT SPDR Equity Large-cap Blend Industrials United States N.A. N.A. 14678.17 0.1 24.43 NXLC COMM SERV SELECT SECTOR SPDR Equity Large-cap Blend Communications United States N.A. N.A. 12663.45 0.1 27.06 NIYW ISHARES USTECHNOLOGY ETF Equity Large-cap Growth Technology United States N.A. N.A. 12641.65 0.39 30.88 NSMH VANECK SEMICONDUCTOR ETF Equity Large-cap Growth Technology United States N.A. N.A. 9581.354 0.35 46.48 NIBB ISHARES BIOTECHNOLOGY ETF Equity Broad Market Blend Health Care United States N.A. N.A. 7717.056 0.44 17.13 NITA ISHARES U.S. AEROSPACE & DEF Equity Broad Market Blend Industrials United States N.A. N.A. 5737.41 0.39 22.93 NPAVE GLOBAL X US INFRASTRUCTURE Equity Broad Market Blend Thematic United States N.A. N.A. 4419.568 0.47 29.65 NPHO INVESCO WATER RESOURCES ETF Equity Broad Market Blend Thematic United States N.A. N.A. 1976.756 0.6 22.49 NPBW INVESCO WILDERHILL CLEAN ENE Equity Broad Market Blend Thematic United States N.A. N.A. 707.19 0.62 45.06 NMSOS ADVISORSHARES PURE US CANN Equity Broad Market Growth Thematic United States N.A. N.A. 337.605 0.74 67.73 YIPO RENAISSANCE IPO ETF Equity Broad Market Growth Thematic United States N.A. N.A. 167.438 0.6 27.31 NName Fund Asset Class Focus Fund Market Cap Focus Fund Industry Focus Fund Geographical Focus Maturity Band Fund Rating Class Focus Tot Asset (M)Sheet1XLU Utilities Select Sector SPDR Fund Equity Utilities United States 15264.641 0.1 18.9 NESGU ISHARES ESG AWARE MSCI USA Equity Broad Market Blend N.A. United States N.A. N.A. 14221.641 0.15 22.44 NESGD ISHARES TRUST ISHARES ESG AW Equity Large-cap Blend N.A. International N.A. N.A. 7427.079 0.2 24.94 NESGV VANGUARD ESG US STOCK ETF Equity Broad Market Blend N.A. United States N.A. N.A. 6607.026 0.09 22.28 NESGE ISHARES INC ISHARES ESG AWAR Equity Large-cap Blend N.A. International N.A. N.A. 4533.127 0.25 25.55 NICLN ISHARES GLOBAL CLEAN ENERGY Equity Broad Market Blend Energy Global N.A. N.A. 4394.26 0.4 29.44 NDSI ISHARES MSCI KLD 400 SOCIAL Equity Large-cap Blend Thematic United States N.A. N.A. 3727.245 0.25 22.34 NTAN INVESCO SOLAR ETF Equity Broad Market Blend Energy Global N.A. N.A. 2086.706 0.66 37.93 NLCTU BLACKROCK US CARBON TR READ Equity Large-cap Blend N.A. United States N.A. N.A. 1502.139 0.3 22.41 YGRID FIRST TRST NASD CL EDG SGIIF Equity Broad Market Blend Thematic Global N.A. N.A. 844.744 0.7 30.11 NFAN FIRST TRUST GLOBAL WIND ENER Equity Broad Market Blend Energy Global N.A. N.A. 265.115 0.6 24.37 NVEA VANGUARD FTSE DEVELOPED ETF Equity Large-cap Blend N.A. International N.A. N.A. 114404.359 0.05 24.78 NIEFA ISHARES CORE MSCI EAFE ETF Equity Large-cap Blend N.A. International N.A. N.A. 99585.789 0.07 24.77 NVWO VANGUARD FTSE EMERGING MARKE Equity Broad Market Blend N.A. International N.A. N.A. 74227.367 0.08 22.46 NIEMG ISHARES CORE MSCI EMERGING Equity Large-cap Blend N.A. International N.A. N.A. 72572.289 0.09 23.89 NVXUS VANGUARD TOTAL INTL STOCK Equity Large-cap Blend N.A. International N.A. N.A. 57558.785 0.07 23.32 NEFA ISHARES MSCI EAFE ETF Equity Large-cap Blend N.A. International N.A. N.A. 50264.996 0.33 24.68 NVEU VANGUARD FTSE ALL-WORLD EX-U Equity Large-cap Blend N.A. International N.A. N.A. 35702.117 0.08 23.13 NVGK VANGUARD FTSE EUROPE ETF Equity Large-cap Blend N.A. European Region N.A. N.A. 19245.125 0.11 26.99 NMCHI ISHARES MSCI CHINA ETF Equity Large-cap Blend N.A. China N.A. N.A. 7954.51 0.58 47.91 NBBCA JPMORGAN BETABUILDERS CANADA Equity Broad Market Blend N.A. Canada N.A. N.A. 6107.155 0.19 23.16 NEWZ ISHARES MSCI BRAZIL ETF Equity Large-cap Blend N.A. Brazil N.A. N.A. 5300.576 0.58 28.44 NINDA ISHARES MSCI INDIA ETF Equity Broad Market Blend N.A. India N.A. N.A. 4889.417 0.68 16.38 NEWT ISHARES MSCI TAIWAN ETF Equity Broad Market Blend N.A. Taiwan N.A. N.A. 4416.63 0.58 34.25 NEWA ISHARES MSCI AUSTRALIA ETF Equity Large-cap Blend N.A. Australia N.A. N.A. 2209.595 0.5 29.36 NEWW ISHARES MSCI MEXICO ETF Equity Broad Market Blend N.A. Mexico N.A. N.A. 1614.605 0.5 26.85 N
